#======================================
# Параметры сборки
# TARGET - название исполняемого файла
#======================================
TARGET  = main
#======================================
# Параметры компиляции
# СС - компилятор
# CFLAGS - флаги для компиляции
#======================================
CC      = g++
CFLAGS  = -pedantic -Wall -Werror -Wno-sign-compare -Wno-long-long -O0 -g -lm -c
#======================================
# Тут подхватываются файлы .cpp
#======================================
SRC    := $(wildcard *.cpp)
#======================================
OBJS   := $(SRC:.cpp=.o)

.PHONY: all clean

all: $(TARGET) clean

$(TARGET): $(OBJS)
	$(CC) -g $^ -o $@
	
%.o: %.cpp %.hpp
	$(CC) $(CFLAGS) $(DEBUG) $<

%.o: %.cpp
	$(CC) $(CFLAGS) $(DEBUG) $<

clean:
	rm *.o